app/controllers/articles_controller.rb

  def index
    @articles = Article.includes(:user).page(params[:page]).per(5).order("created_at DESC")
---
SELECT  `articles`.* FROM `articles` ORDER BY created_at DESC LIMIT 5 OFFSET 0
SELECT COUNT(*) FROM `articles`
SELECT `users`.* FROM `users` WHERE `users`.`id` IN (2, 1)

  def create
    Article.create(image: article_params[:image], text: article_params[:text], user_id: current_user.id)
---
INSERT INTO `articles` (`text`, `image`, `created_at`, `updated_at`, `user_id`) VALUES ('nnnnnnnn', 'http://cms.ipressroom.com.s3.amazonaws.com/249/files/20182/HA+Dreamliner.jpg', '2018-11-22 03:15:59', '2018-11-22 03:15:59', 2)

  def destroy
      article = Article.find(params[:id])
      article.destroy if article.user_id == current_user.id
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 8 LIMIT 1
DELETE FROM `articles` WHERE `articles`.`id` = 8

  def edit
      @article = Article.find(params[:id])
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 4 LIMIT 1

  def update
      article = Article.find(params[:id])
      if article.user_id == current_user.id
        article.update(article_params)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 4 LIMIT 1
UPDATE `articles` SET `text` = 'ffff\r\nyyy', `updated_at` = '2018-11-23 06:58:51' WHERE `articles`.`id` = 4

  def show
    @article = Article.find(params[:id])
    @comment = Comment.new
    @comments = @article.comments.includes(:user)
---
SELECT  `articles`.* FROM `articles` WHERE `articles`.`id` = 7 LIMIT 1
SELECT `comments`.* FROM `comments` WHERE `comments`.`article_id` = 7
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1