app/controllers/comments_controller.rb

  def create
    @comment = Comment.create(comment_params)
---
INSERT INTO `comments` (`user_id`, `article_id`, `text`, `created_at`, `updated_at`) VALUES (2, 4, 'ttttt', '2018-11-23 06:54:55', '2018-11-23 06:54:55')