app/controllers/users_controller.rb

  def show
      user = User.find(params[:id])
      @nickname = user.nickname
      @articles = user.articles.page(params[:page]).per(5).order("created_at DESC")
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
SELECT  `articles`.* FROM `articles` WHERE `articles`.`user_id` = 2 ORDER BY created_at DESC LIMIT 5 OFFSET 0